cs340/backlog.tex
% Created 2024-09-03 Tue 19:07
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Jackson Mowry}
\date{\textit{<2024-09-03 Tue>}}
\title{Backlog}
\hypersetup{
 pdfauthor={Jackson Mowry},
 pdftitle={Backlog},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{Product Name}
\label{sec:org8e9baa5}
Jack Sparrow (previously named FARPCs)\\
\section{Backlog}
\label{sec:org45e162e}

\begin{enumerate}
\item Define XML Schema\\
\begin{itemize}
\item As a user of the tool I would like to have a standardized XML which can be used to ensure my schema files are correct, so that I don't make mistakes when writing them.\\
\end{itemize}
\item Parse XML Schema (Messages)\\
\begin{itemize}
\item As a user of the tool my XML needs to be parsed so that new code can be generated for each of the output languages specified at run time, so that my input changes the output.\\
\end{itemize}
\item Parse XML Schema (Procedures)\\
\begin{itemize}
\item As a user of the tool my XML should be parsed so that server side ``prototypes'' for each procedure can be defined, so that I have a simple API to work with on my backend.\\
\end{itemize}
\item Detect Message Circular Dependencies\\
\begin{itemize}
\item As a user of the tool I would like to be notifed if any of my messages contain circular dependencies, so that I know what to fix in my schema file.\\
\end{itemize}
\item Define Binary Encoding\\
\begin{itemize}
\item As a user of the tool I would like a diagram/explaination as to how messages will be encoded when sent of the network, so that I can assess the potential benefits of this solution for my usecase.\\
\end{itemize}
\item Decide on a Templating Language/Tool\\
\begin{itemize}
\item As a user of the tool I would like a simple templating tool that will allow me to define now code generation paths for a language/framework of my choosing, so that this solution is more appliciable for my usecase.\\
\end{itemize}
\item Prototype Client Code Generation (JavaScript)\\
\begin{itemize}
\item As a user of the tool I would like to see a simple implementation of what the client-side API will look like, so that I can see if it will fit within my product.\\
\end{itemize}
\item Prototype Client Code Generation (Python)\\
\begin{itemize}
\item As a user of the tool I would like to see a rough implementation in Python so I can begin exploring how the tool will fit into my product.\\
\end{itemize}
\item Implement a Simple HTTP Server in C\\
\begin{itemize}
\item As a user of the tool I need to be able to service request via HTTP, so that I can easily integrate with browser based apps.\\
\end{itemize}
\item Implement a Ultra Fast HTTP Server in C Utilizing \texttt{io\_uring}\\
\begin{itemize}
\item As a user of the tool I need to be able to handle thousands of requests per second with ultralow latency, so that I can continue to grow my product.\\
\end{itemize}
\item Prototype Server Code Generation (C)\\
\begin{itemize}
\item As a user of the tool I would like to see how code is generated for the C language (utilizing a simple HTTP server), so that I can begin fitting the solution into my product.\\
\end{itemize}
\item Polished Client Code Generation (JavaScript)\\
\begin{itemize}
\item As a user of the tool I would like to have a production ready implementation of the JavaScript code to begin finalizing my, so that I can get ready to ship my product to users.\\
\end{itemize}
\item Polished Server Code Generation (C)\\
\begin{itemize}
\item As a user of the tool I need a finalized version of the C server code so that I can finish writing my server side code around the framework.\\
\end{itemize}
\item Tutorial to Add New Languages\\
\begin{itemize}
\item As a user of the tool I'd like a simple tutorial showing how to add support for my language on either the server or client side, so that I can integrate this tool into our custom stack.\\
\end{itemize}
\item Direct Communication Over TCP\\
\begin{itemize}
\item As a user of the tool I'd like to cut out the overhead of HTTP and allow my client to communicate with the server directly over HTTP, so that I can reduce latency.\\
\end{itemize}
\end{enumerate}
\end{document}
